Revit 2027 API
RectangleLightShape Methods
The RectangleLightShape type exposes the following members.
Methods
Name | Description
Clone |  Creates a copy of the LightShape derived object.
(Inherited from LightShape)
Dispose
(Inherited from LightShape)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RectangleLightShape Class
Autodesk.Revit.DB.Lighting Namespace